#------------------------------------------Вступление-----------------------------------


Introduction = """Этот тест был написан около 50 лет назад E.M.Jellinek.
Он одинаково подходит как для выявления на признаки алкоголизма у мужчины,
 так и на алкоголизм для женщин. Разницы нет!
Тест составлен так, что бы можно было оценить стадию. 
После прохождения прошу не удивляться тому, что по его результату многие 
попадают в разряд алкоголиков.Это правда. Подавляющее число людей живут, 
 плавно дрейфуя в начальных стадиях алкоголизма и считают, что это норма.
Так что еще раз — не удивляйтесь. Задумайтесь."""

#-------------------------------------------Инструкция--------------------------------------


Instruction = """Как проходить тест на алкоголизм ?
Отвечайте максимально правдиво
Если Ваш ответ иногда — отвечать надо «да»
Если в том вопросе, где несколько пунктов, 
хоть на один вы ответили «да» — ответ «да»."""


#--------------------------------------------Вопросы X1-----------------------------------------


question_1 = """Являются ли Ваши близкие родственники — дедушки бабушки, 
родители, братья, сестры — алкоголиками или наркоманами?"""

question_2 = """Пьете ли Вы, как правило, больше, чем Ваши друзья? 
Часто ли Вы одним из последних уходите из бара?"""

question_3 = """Приносит ли Вам удовольствие выпивка и нетерпеливое ожидание
подходящего случая? Считают ли Вас большим любителем вечеринок?"""

question_4 = """Приходится ли Вам обнаруживать, что Вы не хотите прекратить 
пить после одной или двух рюмок, хотя другим этого было достаточно?"""

question_5 = """Происходили ли какие-нибудь изменения в характере Вашего
потребления алкоголя — пили все более и более часто, пили один и переключались
на более крепкие напитки?"""

question_6 = """Проявляли ли беспокойство или недовольство по поводу Вашей 
пьянки близкие Вам люди — жена, муж, родители, дети?"""

question_7 = """Приводят ли Вас в состояние беспокойства и раздражения мысли 
о безалкогольных мероприятиях — венчание в церкви, прием с безалкогольными 
напитками и т.д.?"""

question_8 = """Удивляло ли Вас когда-нибудь, почему некоторые из Ваших друзей
пьют так медленно или прекращают пить после часа или двух? Покупали ли Вы 
алкоголь для друзей, пытаясь «поддержать» вечеринку?"""

question_9 = """Стремитесь ли Вы залпом выпивать первые рюмки и затем, когда
 почувствуете эффект, замедлять темп до уровня других?"""

#----------------------------------------------Вопросы Х2-----------------------------------------------------

question_10 = """Сожалели ли Вы иногда,будучи трезвым, о том, что Вы сказали 
или сделали, будучи пьяным? Признавали ли Вы себя виноватым за Ваше поведение 
перед любящими Вас людьми и обещали ли измениться?	
"""

question_11 = """Пытались ли Вы когда-нибудь прекратить пить в течение 
определенного времени (недели или, может быть, месяца), так как чувствовали,
что «это было бы неплохо для Вас» или потому, что хотели доказать,
что Вы можете это?"""

question_12 = """Обещали ли Вы себе, что будете контролировать количество 
выпитого или снизите это количество, 
и не выполнили это обещание?"""

question_13 = """Можете ли Вы сейчас выпить больше, чем год назад? Есть ли 
тенденция пить значительно больше?"""

question_14 = """Была ли у Вас потеря памяти (Вы не можете вспомнить некоторые
или все события,которые происходили, когда Вы были пьяны?) Бывает ли у Вас 
это сейчас чаще, чем было год назад?"""

question_15 = """Были ли у Вас трудности на работе — постоянные болезни, 
трудно сосредоточиться,претензии со стороны сослуживцев или начальников — 
такие, которые могли быть связаны с Вашей пьянкой?"""

question_16 = """Чувствовали ли Вы себя иногда лучше, когда Вы пили, чем
когда Вы не пили? Действительно ли выпивка избавляла Вас от головной боли,
 напряжения, беспокойства, колебаний настроения?"""

question_17 = """Чувствовали ли Вы возрастающую вину по поводу своей выпивки,
но, тем не менее, когда кто-то любящий Вас проявлял свое беспокойство, Вы 
становились враждебны и пытались защищаться?"""

question_18 = """Склонны ли Вы думать, что Ваши проблемы — это результат 
напряжения и стресса или, что Вас не понимает Ваш супруг(а), или к Вам 
предъявляют чрезмерные требования на работе? Было ли Вам себя жалко, так 
как Вам казалось, что никто Вас не понимает? 
Прибегали ли Вы к алкоголю для утешения и успокоения?"""


#-------------------------------------------------Вопросы Х3--------------------------------------------------------

question_19 = """Есть ли у Вас тяга к алкоголю,такое сильное желание выпить,
что Вы готовы рискнуть разругаться с Вашим супругом (ой) или получить 
выговор от начальника?"""

question_20 = """Увеличивается ли у Вас тенденция выпивать больше, 
чем Вы предполагали в начале? Трудно ли Вам остановиться пить, однажды начав?
 Пили ли Вы когда-нибудь сразу после пробуждения?"""

question_21 = """Бывает ли у Вас иногда после пьянки дрожь в руках, с которой
Вы не можете совладать? Чувствуете ли Вы себя физически больным (тошнота, 
тряска, слабость) и/или появляются психопатические расстройства (депрессия,
беспокойство, возбуждение, дурное настроение, раздражение), если Вы не пили? 
Улучшает ли алкоголь Ваше самочувствие?"""

question_22 = """Есть ли у Вас болезни или нарушения в организме, которые 
могут быть связаны с алкоголем,такие как гастрит, периодический понос, 
вирус иммунодефицита, носовые кровотечения, гипертония, пневмония, 
сердцебиение, увеличенная печень, абсцессы, гепатиты, циррозы, 
белая горячка, эпилепсия или панкреатит?"""

question_23 = """Были ли Вы госпитализированы из-за повреждений, несчастных
случаев или травм, происшедших во время выпивок и, возможно, вызванных тем,
что выпили слишком много?"""

question_24 = """Бывают ли у Вас когда-нибудь мысли о самоубийстве? Были ли
у Вас галлюцинации после запоя или при приеме кокаина? Были ли у Вас 
беспричинные страхи (например, приводили ли Вас в состояние тревоги 
и страха звонок в дверь или телефонный звонок)?"""

question_25 = """Были ли у Вас потери из-за пьянки — потеря работы, развод,
отчуждение детей или семьи, задержание за управление машиной в нетрезвом 
состоянии, потери имущества, деловых контактов и т.д.?"""

question_26 = """Пренебрегаете ли Вы едой, особенно, во время и сразу же
после запоя? Не перестали ли Вы заниматься собой — перестали заниматься 
зарядкой, принимать душ, обращаться к врачу, 
если есть проблемы со здоровьем?	"""

question_27 = """Выпиваете ли Вы меньше, чем Вы могли когда-то, и, когда
Вы пьете, есть ли у Вас тенденция напиваться до потери сознания или до такого
пресыщения, что Вы просто не можете больше?"""

question_28 = '''Тест пройден'''